# DefinitionBindingMap Properties

---
The DefinitionBindingMap type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the map is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Item|
| Size| Returns the number of bindings that are in the map.
Top
#### Reference
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace